In [2]:
import numpy as np
import pandas as pd

In [4]:
# Membuat dataframe dengan datanya random terdiri dari 5 baris dan 4 kolom
# dengan indexnya adalah A B C D yang di split
# Split adalah memotong- motong string dan menjadikanya sebuah array
# menetapkan kolomnya adalah W X Y Z yang di split
df = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(),columns=' W X Y Z'.split())
df

          W         X         Y         Z
A -0.384512 -1.759998 -1.837536  1.709054
B -0.351456 -0.340059  1.879453  3.063895
C -0.540280  0.928689 -0.539899  0.888114
D -0.392455  0.390157  0.366582 -0.207384
E  0.553541 -0.629739 -1.258415 -0.913326

In [6]:
df['W'] #menampilkan data pada colum W

A   -0.384512
B   -0.351456
C   -0.540280
D   -0.392455
E    0.553541
Name: W, dtype: float64

In [8]:
# bisa juga seperti ini namun tidak direkomendasikan
df.W

A   -0.384512
B   -0.351456
C   -0.540280
D   -0.392455
E    0.553541
Name: W, dtype: float64

In [9]:
# Menampilkan 2 kolom sekaligus dan harus memeahami kurung [] 2x
df [['W','Z']]

          W         Z
A -0.384512  1.709054
B -0.351456  3.063895
C -0.540280  0.888114
D -0.392455 -0.207384
E  0.553541 -0.913326

In [11]:
# Membuta kolom baru yang bernama baru yang datanya diambil dari kolom W ditambah kolom Y
df['baru'] = df['W'] + df['Y']
df

          W         X         Y         Z      baru
A -0.384512 -1.759998 -1.837536  1.709054 -2.222048
B -0.351456 -0.340059  1.879453  3.063895  1.527997
C -0.540280  0.928689 -0.539899  0.888114 -1.080179
D -0.392455  0.390157  0.366582 -0.207384 -0.025873
E  0.553541 -0.629739 -1.258415 -0.913326 -0.704874

In [12]:
# Menghapus kolom
df.drop('baru', axis=1) # baru adalah nama kolom dan axis adalah posisi atau tempat yang akan di hapus
                        # jika 0 = index dan jika 1 = kolom

          W         X         Y         Z
A -0.384512 -1.759998 -1.837536  1.709054
B -0.351456 -0.340059  1.879453  3.063895
C -0.540280  0.928689 -0.539899  0.888114
D -0.392455  0.390157  0.366582 -0.207384
E  0.553541 -0.629739 -1.258415 -0.913326

In [14]:
# memakai cara di atas berhasil tetapi ketika dipanggil kembali maka
df

          W         X         Y         Z      baru
A -0.384512 -1.759998 -1.837536  1.709054 -2.222048
B -0.351456 -0.340059  1.879453  3.063895  1.527997
C -0.540280  0.928689 -0.539899  0.888114 -1.080179
D -0.392455  0.390157  0.366582 -0.207384 -0.025873
E  0.553541 -0.629739 -1.258415 -0.913326 -0.704874

In [16]:
# jadi beginilah caranya
df.drop('baru',axis=1, inplace=True) # Ketika inplace True maka mengeksekusi langsung ditempat
                                    # tetapi tidak bisa menampilkan langsung datanya

In [17]:
df

          W         X         Y         Z
A -0.384512 -1.759998 -1.837536  1.709054
B -0.351456 -0.340059  1.879453  3.063895
C -0.540280  0.928689 -0.539899  0.888114
D -0.392455  0.390157  0.366582 -0.207384
E  0.553541 -0.629739 -1.258415 -0.913326

In [21]:
# Menghapus Baris
df.drop('E',axis=0) #axis = 0 adalah baris

          W         X         Y         Z
A -0.384512 -1.759998 -1.837536  1.709054
B -0.351456 -0.340059  1.879453  3.063895
C -0.540280  0.928689 -0.539899  0.888114
D -0.392455  0.390157  0.366582 -0.207384

In [22]:
# menampilkan data 1 baris
df.loc['A'] # A adalah nama index labels

W   -0.384512
X   -1.759998
Y   -1.837536
Z    1.709054
Name: A, dtype: float64

In [23]:
df.iloc[2] # untuk mendapatkan data by index

W   -0.540280
X    0.928689
Y   -0.539899
Z    0.888114
Name: C, dtype: float64

In [25]:
# Mendapatkan data terperinci
df.loc['C','Z'] # Mengambil data dari baris C dan kolom Z

0.888114110182984

In [26]:
df.loc[['A','B'],['W','Y']] # Mengambil data daris bari A dan B, kolom W dan Y

          W         Y
A -0.384512 -1.837536
B -0.351456  1.879453

In [27]:
df > 0 # menseleksi data yang lebih dari 0

       W      X      Y      Z
A  False  False  False   True
B  False  False   True   True
C  False   True  False   True
D  False   True   True  False
E   True  False  False  False

In [28]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  1.709054
B       NaN       NaN  1.879453  3.063895
C       NaN  0.928689       NaN  0.888114
D       NaN  0.390157  0.366582       NaN
E  0.553541       NaN       NaN       NaN

In [29]:
# Menampilkan data berdasarkan kolom W yang lebih dari 0
df[df['W']>0]

          W         X         Y         Z
E  0.553541 -0.629739 -1.258415 -0.913326

In [30]:
# Menampilkan data kolom Y berdasarkan pada kolom W yang lebih dari 0
df[df['W']>0]['Y']

E   -1.258415
Name: Y, dtype: float64

In [31]:
# Menampilkan data kolom Y dan X berdasarkan pada kolom W yang lebih dari 0
df[df['W']>0][['Y','X']]

          Y         X
E -1.258415 -0.629739

In [32]:
# Menampilkan data berdasarkan kolom w yang lebih dari 0 dan kolom X lebih dari 1
df[(df['W']>0)& (df['X']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [33]:
# Menampilkan data berdasarkan kolom w yang lebih dari 0 dan kolom X lebih dari 0
df[(df['W']>0) | (df['X']>0)]

          W         X         Y         Z
C -0.540280  0.928689 -0.539899  0.888114
D -0.392455  0.390157  0.366582 -0.207384
E  0.553541 -0.629739 -1.258415 -0.913326

In [35]:
# Detail Indexing
# Mereset index labels menjadi index default
df.reset_index()

  index         W         X         Y         Z
0     A -0.384512 -1.759998 -1.837536  1.709054
1     B -0.351456 -0.340059  1.879453  3.063895
2     C -0.540280  0.928689 -0.539899  0.888114
3     D -0.392455  0.390157  0.366582 -0.207384
4     E  0.553541 -0.629739 -1.258415 -0.913326

In [36]:
# Membuat kolom baru
df["code"] = "IND JPN USA RSA IND".split()

In [37]:
df

          W         X         Y         Z code
A -0.384512 -1.759998 -1.837536  1.709054  IND
B -0.351456 -0.340059  1.879453  3.063895  JPN
C -0.540280  0.928689 -0.539899  0.888114  USA
D -0.392455  0.390157  0.366582 -0.207384  RSA
E  0.553541 -0.629739 -1.258415 -0.913326  IND

In [38]:
# Mengatur agar code menjadi index labels
df.set_index('code')

             W         X         Y         Z
code
IND  -0.384512 -1.759998 -1.837536  1.709054
JPN  -0.351456 -0.340059  1.879453  3.063895
USA  -0.540280  0.928689 -0.539899  0.888114
RSA  -0.392455  0.390157  0.366582 -0.207384
IND   0.553541 -0.629739 -1.258415 -0.913326

In [39]:
# ketika di tampilkan sama seperti
# drop tidak berubah dan harus menggunakan inplace
df

          W         X         Y         Z code
A -0.384512 -1.759998 -1.837536  1.709054  IND
B -0.351456 -0.340059  1.879453  3.063895  JPN
C -0.540280  0.928689 -0.539899  0.888114  USA
D -0.392455  0.390157  0.366582 -0.207384  RSA
E  0.553541 -0.629739 -1.258415 -0.913326  IND

In [40]:
df.set_index('code', inplace=True)
df

             W         X         Y         Z
code
IND  -0.384512 -1.759998 -1.837536  1.709054
JPN  -0.351456 -0.340059  1.879453  3.063895
USA  -0.540280  0.928689 -0.539899  0.888114
RSA  -0.392455  0.390157  0.366582 -0.207384
IND   0.553541 -0.629739 -1.258415 -0.913326

In [42]:
# MULTI INDEXING
dataLabels = ['G1','G1','G1','G2','G2','G2']
dataValue = [ 1,2,3,1,2,3]
data = list(zip(dataLabels,dataValue)) # zip menggabungkan 2 array atau lebih menjadi beberapa tuple
                                        # List : membuat list dari tuple - tuple yang ada
data = pd.MultiIndex.from_tuples(data) # MultiIndex : membuat beberapa pengindexan baru dari sebuah tuple

In [43]:
list(zip(dataLabels,dataValue))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [44]:
data

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [46]:
# Membuat sebuah dataframe baru dengan data random 6 baris dan 2 kolom
# index dari dataframe ini adalah variabel data dikarenakan tedapat banyak data kembar maka
# data tersebut dikemas yaitu G1 dan G2 , dan 1 2 3 menjadi sub indexnya
# Nama kolomnya adalah A dan B
df = pd.DataFrame(np.random.rand(6,2), index = data, columns = ['A','B'])
df

             A         B
G1 1  0.455179  0.027748
   2  0.504259  0.856692
   3  0.399624  0.171185
G2 1  0.468525  0.452810
   2  0.961297  0.334326
   3  0.328079  0.492980

In [48]:
# Menampilkan index dari G1
df.loc['G1']

          A         B
1  0.455179  0.027748
2  0.504259  0.856692
3  0.399624  0.171185

In [51]:
# menampilkan index dari G1 sub index 3
df.loc['G1'].loc[3]

A    0.399624
B    0.171185
Name: 3, dtype: float64

In [52]:
# Melihat nama index
df.index.names

FrozenList([None, None])

In [56]:
# Merubah nama index
df.index.names = ['Group','Num']

In [57]:
df

                  A         B
Group Num
G1    1    0.455179  0.027748
      2    0.504259  0.856692
      3    0.399624  0.171185
G2    1    0.468525  0.452810
      2    0.961297  0.334326
      3    0.328079  0.492980

In [58]:
df.xs('G1') # xs Untuk menampilkan data frame multiindex

            A         B
Num
1    0.455179  0.027748
2    0.504259  0.856692
3    0.399624  0.171185

In [59]:
# Menampilkan index labels G2 dengan sub index 2
df.xs(['G2',2])

A    0.961297
B    0.334326
Name: (G2, 2), dtype: float64

In [60]:
# Menampilkan sub index 1 dari kolom Nnum
df.xs(1, level='Num')

              A         B
Group
G1     0.455179  0.027748
G2     0.468525  0.452810